<a href="https://colab.research.google.com/github/vincent0965/Colab_note/blob/master/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [28]:
from urllib.request import urlretrieve
url = "https://github.com/Elwing-Chou/ml0930/raw/master/titanic/train.csv"
urlretrieve(url, "train.csv")
url = "https://github.com/Elwing-Chou/ml0930/raw/master/titanic/test.csv"
urlretrieve(url, "test.csv")

('test.csv', <http.client.HTTPMessage at 0x7f8dfaefaf98>)

In [30]:
import pandas as pd
train_df = pd.read_csv("train.csv")
test_df = pd.read_csv("test.csv")

In [31]:
datas = pd.concat([train_df, test_df], axis=0, ignore_index=True)

In [32]:
# del data(PassengerId, Survived)
# data type: number:age、SibSp、Parch、Ticket(count)、Fare；type:P-Class、Name(mid)、Sex、Cabin(First)、Embarked
datas.drop(["PassengerId", "Survived"], axis=1)

      Pclass                                               Name  ... Cabin  Embarked
0          3                            Braund, Mr. Owen Harris  ...   NaN         S
1          1  Cumings, Mrs. John Bradley (Florence Briggs Th...  ...   C85         C
2          3                             Heikkinen, Miss. Laina  ...   NaN         S
3          1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  ...  C123         S
4          3                           Allen, Mr. William Henry  ...   NaN         S
...      ...                                                ...  ...   ...       ...
1304       3                                 Spector, Mr. Woolf  ...   NaN         S
1305       1                       Oliva y Ocana, Dona. Fermina  ...  C105         C
1306       3                       Saether, Mr. Simon Sivertsen  ...   NaN         S
1307       3                                Ware, Mr. Frederick  ...   NaN         S
1308       3                           Peter, Master. Michael J  ...   NaN         C

[1309 rows x 10 columns]

In [19]:
# make up none data: type=>fill usually value
na = datas.isna().sum()
# chooes data:Series[True/False list/series]
na[na > 0].sort_values(ascending=False)
# ascending

Cabin       1014
Survived     418
Age          263
Embarked       2
Fare           1
dtype: int64

In [21]:
most = datas["Embarked"].value_counts().idxmax()
datas["Embarked"] = datas["Embarked"].fillna(most)